Revit 2027 API
StructuralConnectionCodeCheckingStatus Enumeration
 An enumerated type listing all code checking status of the structural connection element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StructuralConnectionCodeCheckingStatus
Public Enumeration StructuralConnectionCodeCheckingStatus
public enum class StructuralConnectionCodeCheckingStatus
type StructuralConnectionCodeCheckingStatus
Members
Member name | Value | Description
CheckingFailed | 2 |  Status checking failed.
NotCalculated | 0 |  Status not calculated.
OkChecked | 1 |  Status OK checked.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace